{
    "last_updated":"2023-09-13T15:21:26Z",
    "linkedin_profile_url":"https://www.linkedin.com/in/stevengoh",
    "profile":{
       "accomplishment_courses":[
          
       ],
       "accomplishment_honors_awards":[
          
       ],
       "accomplishment_organisations":[
          {
             "description":null,
             "ends_at":null,
             "org_name":"Pollenizer",
             "starts_at":{
                "day":1,
                "month":1,
                "year":2013
             },
             "title":"Advisory Board"
          }
       ],
       "accomplishment_patents":[
          
       ],
       "accomplishment_projects":[
          
       ],
       "accomplishment_publications":[
          
       ],
       "accomplishment_test_scores":[
          
       ],
       "activities":[
          
       ],
       "articles":[
          
       ],
       "background_cover_image_url":null,
       "birth_date":null,
       "certifications":[
          
       ],
       "city":"United States",
       "connections":null,
       "country":"US",
       "country_full_name":"United States of America",
       "education":[
          
       ],
       "experiences":[
          {
             "company":"Achiko AG",
             "company_linkedin_profile_url":null,
             "description":"Listed on SIX as a rollup of payments and gaming applications at the end of 2019.  Shortly after the Covid-19 pandemic commenced, resulted in management and operational changes and stepped in as CEO in mid 2020.  Moved the payments business to a certification / passport engine, and secured a novel rapid diagnostic test from Spain using DNA Aptamers.  Looked to 3 means to commercialisation and settled around one route between Taiwan and Indonesia.  The one route, delivered a highly accurate, low cost rapid test for Covid-19 that was both friendlier, substantially more accurate than rapid tests, and more cost effective than a PCR Test.  The test includes a successful patent filing, and innovations in signal processing.   Low cost, accurate diagnostics matter because for most of the world's population, healthcare is only unlocked through the a diagnostic test.  PCR tests are often expensive and may be poorly applied, and many rapid tests suffer from quality and accuracy issues.  Last mile production issues in Indonesia have plagued the company.  This is being fixed and the company is looking to restructure.",
             "ends_at":null,
             "location":"Switzerland",
             "logo_url":null,
             "starts_at":{
                "day":1,
                "month":2,
                "year":2019
             },
             "title":"Chief Executive Officer"
          },
          {
             "company":"Heracles Investment Group Limited",
             "company_linkedin_profile_url":null,
             "description":"Trading as Super Cool Ventuers (SCV Group).  Developing several tech ventures from finance, healthcare, media and gaming.",
             "ends_at":null,
             "location":null,
             "logo_url":null,
             "starts_at":{
                "day":1,
                "month":8,
                "year":2010
             },
             "title":"Founder"
          },
          {
             "company":"mig.me",
             "company_linkedin_profile_url":null,
             "description":"One of the world's early social networks of any size.  Was originally a multi headed mobile client with discount voice calsl and SMS, Group chat and chatroom games, and a gamified user get user.  At it's peak, had tens of millions of active users in South and South East Asia.  Developed an economy of user credit trading allowing the company to collect cash from the remotest of places. At it's peak, venture funded by Accel, Redpoint in 2007 and then DCM in 2009.  Operations in SF, Malaysia and Nanjing.  Transition from feature phone to smartphone with FIH as a key shareholder in 2014,  with principal operations in Singapore, Malaysia and Indonesia.   Raised over USD$40m and listed through an RTO and peak valuation of close to AUD$400m.    Finally struggled to make the transition from feature phone to a family of smartphone / web apps and align shareholders and operations to opportunity, and after many attempts to recap / reconstruct, liquidated in 2016.",
             "ends_at":{
                "day":31,
                "month":5,
                "year":2018
             },
             "location":null,
             "logo_url":null,
             "starts_at":{
                "day":1,
                "month":11,
                "year":2005
             },
             "title":"Chief Executive Officer and Co-Founder"
          },
          {
             "company":"BellDirect",
             "company_linkedin_profile_url":null,
             "description":null,
             "ends_at":{
                "day":31,
                "month":5,
                "year":2012
             },
             "location":null,
             "logo_url":null,
             "starts_at":{
                "day":1,
                "month":4,
                "year":2010
             },
             "title":"Executive Chairman"
          },
          {
             "company":"BellDirect",
             "company_linkedin_profile_url":null,
             "description":"Working in partnership with Bell Potter, built and developed a leading online stockbroking company 15% under budget, and 1 month under the 6 month timeline.  Everything from live information, automated settlement, integrated IVR systems, etc.     Assembled the team, financed the company, secured key resources in Sydney, Perth and Kuala Lumpur to deliver an end to end specialist operation.",
             "ends_at":{
                "day":30,
                "month":4,
                "year":2010
             },
             "location":"Australia",
             "logo_url":null,
             "starts_at":{
                "day":1,
                "month":9,
                "year":2007
             },
             "title":"Co-Founder"
          },
          {
             "company":"Sanford Ltd",
             "company_linkedin_profile_url":null,
             "description":"Founded in 1995, and launched in early 1996.  Australia's first online stockbroking business. Unique in that it developed everything from wire at the wall to the customer including live data, order processing, settlement, payments, alerts (including mobile), etc.    Personally responsible for everything from writing advertising copy, to writing code (especially the settlement Systems).   End-to-end systems ownership meant we had both a cost and innovation advantage over other players: trading and settlement of Shares and Options, Live information (quotes, market detail and depth, etc), charts and maps, news services (including live streaming of news with Ralph Wragg), Email and Mobile Alerts, Online Bookbuilds and Channel innovation with Virtual broker which enabled several thousand finanacial planners and 150 Financial planning companies (from ING to single man operations) to operate a cobranded direct share trading operation.  Helped over 120 capital issues for over $1bn in amounts raised.  Additionally, built the outsourced operations for National Australia Bank Securities business in a matter of weeks.  This involved building and deploying over 100 servers, hiring/training a few hundred people, integrated IVR to straight through processing and settlement systems, bank integration, amongst other things.  Raised around AUD$13m privately and listed on ASX for around AUD$150m in 2000 with OM Group, UBS, and National Australia Bank as key shareholders.",
             "ends_at":{
                "day":31,
                "month":3,
                "year":2003
             },
             "location":"Australia",
             "logo_url":null,
             "starts_at":{
                "day":1,
                "month":6,
                "year":1995
             },
             "title":"Cofounder and CEO"
          },
          {
             "company":"Your Beautiful Life",
             "company_linkedin_profile_url":"https://www.linkedin.com/company/ybeautiful-life/",
             "description":"Founded in 2018, on the insight that financial planning and wealth management could be better delivered with a contemporary user experience framework, attenuated with a machine leaning framework.   In 2023, with the advent of a critical mass of AI technologies, moving quickly to deliver an end to end multimodal AI SAAS solution to enable a transformation of customer experience and cost structure for financial planning and wealth management.  May be applied to other enterprise environments.    Operations in Silicon Valley, Sydney and HCMC.",
             "ends_at":null,
             "location":"United States",
             "logo_url":"https://media.licdn.com/dms/image/D4E0BAQEBq_LuEfOUEQ/company-logo_400_400/0/1689674876218?e=1702512000&v=beta&t=wRrZzp-pA1SU-uGIP-tFV3afp5XRcM2HMd7L4lzLhgk",
             "starts_at":{
                "day":1,
                "month":3,
                "year":2018
             },
             "title":"Co-Founder"
          }
       ],
       "extra":null,
       "first_name":"Steven",
       "follower_count":2597,
       "full_name":"Steven Goh",
       "gender":null,
       "groups":[
          
       ],
       "headline":"Tech ",
       "industry":null,
       "inferred_salary":null,
       "interests":[
          
       ],
       "languages":[
          
       ],
       "last_name":"Goh",
       "occupation":"Chief Executive Officer at Achiko AG",
       "people_also_viewed":[
          {
             "link":"https://www.linkedin.com/in/gslucas",
             "location":null,
             "name":"George Lucas",
             "summary":"CEO/Founder/Director | Thought Leader | Entrepreneur"
          },
          {
             "link":"https://www.linkedin.com/in/chidiebereernest",
             "location":null,
             "name":"Chidiebere Ernest",
             "summary":"Full Stack Web and Mobile Developer | Mechanical Engineering (In view)"
          },
          {
             "link":"https://www.linkedin.com/in/leo-feradero-nugraha",
             "location":null,
             "name":"Leo Feradero Nugraha",
             "summary":"Software Engineer"
          },
          {
             "link":"https://www.linkedin.com/in/m-yusril-sabir",
             "location":null,
             "name":"M Yusril Sabir",
             "summary":"Software Engineer at Nubela"
          },
          {
             "link":"https://www.linkedin.com/in/ashlyn-collins-554803134",
             "location":null,
             "name":"Ashlyn Collins",
             "summary":"Experienced Senior Manager specialising in Product Management, Digital Transformation and Data Management. Driving business success through innovation, process simplification and continuous improvement."
          },
          {
             "link":"https://www.linkedin.com/in/meilin",
             "location":null,
             "name":"Mei Lin W.",
             "summary":"Marketing | Communications | Growth | Start Ups"
          },
          {
             "link":"https://www.linkedin.com/in/sarahchian",
             "location":null,
             "name":"Sarah Chian",
             "summary":"Strategic Account Executive at Salesforce.org"
          },
          {
             "link":"https://www.linkedin.com/in/alvinyap",
             "location":null,
             "name":"Alvin Yap",
             "summary":"Serial Tech-Entrepreneur in South East Asia"
          },
          {
             "link":"https://www.linkedin.com/in/meganrosecutrofello",
             "location":null,
             "name":"Megan River Cutrofello",
             "summary":"Unsung Hero of Esports"
          },
          {
             "link":"https://www.linkedin.com/in/richardrobinson",
             "location":null,
             "name":"Rich Robinson",
             "summary":"Entrepreneur In Residence @ Animoca Brands | Blockchain, NFTs"
          }
       ],
       "personal_emails":[
          
       ],
       "personal_numbers":[
          
       ],
       "profile_pic_url":"https://s3.us-west-000.backblazeb2.com/proxycurl/person/stevengoh/profile?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=0004d7f56a0400b0000000001%2F20240102%2Fus-west-000%2Fs3%2Faws4_request&X-Amz-Date=20240102T010949Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Signature=32628b40992a8f85eb74a4ad97a2d358003a68af32ee1b413ecc5ed68093e86e",
       "public_identifier":"stevengoh",
       "recommendations":[
          
       ],
       "similarly_named_profiles":[
          {
             "link":"https://my.linkedin.com/in/steven-goh-56b3b177",
             "location":"Selangor, Malaysia",
             "name":"Steven Goh",
             "summary":"Fluid Control and Measuring System"
          },
          {
             "link":"https://sg.linkedin.com/in/steven-goh-542b9ba3",
             "location":"Singapore",
             "name":"Steven Goh",
             "summary":"Department Manager at ST Engineering Info-Security Pte Ltd"
          },
          {
             "link":"https://au.linkedin.com/in/steven-goh-a618985",
             "location":"Greater Sydney Area",
             "name":"Steven Goh",
             "summary":"Transformation Program Manager at AMP"
          },
          {
             "link":"https://sg.linkedin.com/in/steven-goh-a9a531a",
             "location":"Singapore",
             "name":"Steven Goh",
             "summary":"Deputy Director at Helmsion Engineering Pte Ltd"
          },
          {
             "link":"https://sg.linkedin.com/in/steven-goh-07095626",
             "location":"Singapore",
             "name":"Steven Goh",
             "summary":"Managing Director, SG Retail Network Pte Ltd"
          }
       ],
       "skills":[
          
       ],
       "state":null,
       "summary":"Steven has founded/cofounded several companies, from Australia's first online Financial Services Companies, Sanford in 1996, one of the worlds first mobile social networks migme in 2003, to biotech (Achiko AG), Your Beautiful Life (AI/Financial Planning & Wealth management), and others.  4 have had a customer reach of more than 10m each.  Over the past 30 years, he is grateful to have worked with top tier venture capitalists in Silicon Valley and across the world, with meaningful Strategics (including some of the largest companies in the world), dozens of incubators and hundreds of other startups, Stock Exchanges, Investment Banks, etc.    During this time, he has developed extensive experience in developing and commercialising compelling internet services for social, consumers & finance.   He has worked professionally in chartered accounting, stockbroking and investment banking, and in consulting to a wide range of financial institutions in Australia, Asia, and Europe.   And he maintains an avid interest in a range of Tech: IT, Bio, etc. A consequence of his professional experience, he has also been involved in a few hundred capital issues and transactions for over USD$1bn, including raising over USD$100m for companies that he himself has founded and led, and 4 exits of greater than USD$100m each.  Steven has won numerous professional and business awards. He has extensive private and public board experience, is a frequent speaker at conferences in Silicon Valley, Europe, Asia, & Australia, and has appeared on Wall St Journal, Australian Financial Review, CNBC, Financial Times, the Economist, Bloomberg and many others",
       "volunteer_work":[
          
       ]
    }
 }